In [ ]:
================== EDA ==========================
1) Pandas : Data frame applications
2) Numpy : Numerical python All math applications
3) Matplotlib: used for plotting
4) Seaborn : used for plot
5) plotly : use for plot
6) Bokhe : plot
=================== Machine learning ==================
7) Sickit-learn: sklearn
===================== Deep Learning ==================
8) Tensorflow : Google
9) Keras : Google
10) Pytorch : FaceBook
====================== NLP ===========================
11) NLTK : Natural langague tool kit
12) Scipy
================ BERT =============================
13) Transformers : Hugging face (Google)
============ Google models =======================
14) Specific google packages
============== Azure ML=========================
15) Azure packages
============= GenAI ==============================
16) Gemini : Google
17) ChatGPT : OpenAI
====================== LangChain==================
18) LangChain packages

#### create a dataframe using list :

In [ ]:
- list ===> Dictionary
- dictionary ===> list

### Step-1
#### create a dataframe :
- In the DataFrame D,F should be capital letters, otherwise gives error

In [1]:
import pandas as pd   # pd is the alias name for pandas
names=['Ayush','Avinash','Akash']
pd.DataFrame()   # empty dataframe will be created here, no rows and no columns

Empty DataFrame
Columns: []
Index: []

### Step-2
#### provide the data

In [2]:
names=['Ayush','Avinash','Akash']
pd.DataFrame(names)

         0
0    Ayush
1  Avinash
2    Akash

In [4]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
pd.DataFrame(names,age)
# what is the first positional argument: data
# second positional argument: index

          0
25    Ayush
30  Avinash
35    Akash

In [5]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
pd.DataFrame(zip(names,age))

         0   1
0    Ayush  25
1  Avinash  30
2    Akash  35

In [6]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']
pd.DataFrame(zip(names,age,city))

         0   1        2
0    Ayush  25      hyd
1  Avinash  30      blr
2    Akash  35  chennai

In [7]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']
data=zip(names,age)
pd.DataFrame(data,city)

               0   1
hyd        Ayush  25
blr      Avinash  30
chennai    Akash  35

In [9]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']
data=zip(names,age)
pd.DataFrame(zip(data,city))

               0        1
0    (Ayush, 25)      hyd
1  (Avinash, 30)      blr
2    (Akash, 35)  chennai

### Step-3
#### provide the column names

In [10]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
pd.DataFrame(zip(names,age),
             columns=['Names','Age'])

     Names  Age
0    Ayush   25
1  Avinash   30
2    Akash   35

In [11]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']
data=zip(names,age,city)      # data
cols=['Names','Age','City']   # columns
pd.DataFrame(data,columns=cols)

     Names  Age     City
0    Ayush   25      hyd
1  Avinash   30      blr
2    Akash   35  chennai

In [12]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']
data=zip(names,age,city)      # data
cols=['Names','Age','City']   # columns
df=pd.DataFrame(data,columns=cols)
type(df)

pandas.core.frame.DataFrame

### Step-4
#### add new column

- If you want to add new column
- First you need to check the number of rows in already existed data
- For example in above the dataframe has 3 rows
- You need to create a new list with 3 rows
- that list equate to the dataframe

In [13]:
job=['DS','DE','CS']   # new list with 3 rows
df['JOB']=job    # df is the existed dataframe with 3 rows
df

     Names  Age     City JOB
0    Ayush   25      hyd  DS
1  Avinash   30      blr  DE
2    Akash   35  chennai  CS

In [14]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']
data=zip(names,age,city)      # data
cols=['Names','Age','City']   # columns
df=pd.DataFrame(data,columns=cols)
df

     Names  Age     City
0    Ayush   25      hyd
1  Avinash   30      blr
2    Akash   35  chennai

In [16]:
job=['DS','DE','CS']   # new list with 3 rows
df['JOB']=job    # df is the existed dataframe with 3 rows and new column name is 'JOB'
df

     Names  Age     City JOB
0    Ayush   25      hyd  DS
1  Avinash   30      blr  DE
2    Akash   35  chennai  CS

### Step-5
#### update the already existed column

- create new column and update new column both are same way

In [17]:
df['Age']=[35,40,45]   # values in 'Age' column will be updated
df

     Names  Age     City JOB
0    Ayush   35      hyd  DS
1  Avinash   40      blr  DE
2    Akash   45  chennai  CS

### Step-6
#### change the index

In [19]:
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','blr','chennai','mumbai']
data=zip(names,age,city)      # data
cols=['Names','Age','City']   # columns
idx=['A','B','C','D']     # index
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df
# all the lists of data should be in same length otherwise it throws an value error like this
# ValueError: Length of values (3) does not match length of index (4)

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   mumbai

**Note**
- Number of list equals to Number of columns
- Number of values inside list equals to Number of rows
- When you create the data all the lists will be in same length

### Step-7
#### shape

- number of rows
- number of columns

In [21]:
df.shape
# matrix format
# 4 rows and 3 columns

(4, 3)

In [22]:
print("The number of rows are:",df.shape[0])
print("The number of columns are:",df.shape[1])

The number of rows are: 4
The number of columns are: 3

### Step-8
#### drop the column

- In order to drop column we required 3 arguments
- Column name
    - The coulmn name we need to mention
- axis
    - axis=0 represents rows
    - axis=1 represnts columns
- inplace
    - we are dropping column means we are modifying the data frame
    - so this modifications we want to save in same variable or different variable
    - If you want to keep in the same varaible the inplace=True

In [23]:
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   mumbai

In [ ]:
df.drop('City',axis=1,inplace=True)
df
# 'City' column will be removed from the same dataframe df

In [27]:
df

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [28]:
df1=df.drop('Age',axis=1)  # do not give inplace=True, so it won't affect any change in df
df1  # df1 will have only one column

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

In [29]:
df  # has two columns

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [31]:
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','blr','chennai','mumbai']
data=zip(names,age,city)      # data
cols=['Names','Age','City']   # columns
idx=['A','B','C','D']     # index
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   mumbai

In [32]:
df.drop('City',axis=1,inplace=True)
df  # df will have only Names, Age columns

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [33]:
df.drop('Age',axis=1)

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

In [ ]:
# as inplace=True is not there the drop of column Age won't affect the df

In [34]:
df

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

### Step-9
#### multiple columns drop

In [35]:
# again read the data
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','blr','chennai','mumbai']
data=zip(names,age,city)      # data
cols=['Names','Age','City']   # columns
idx=['A','B','C','D']     # index
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   mumbai

In [36]:
df.drop(['Age','City'],axis=1,inplace=True)
df   # Age, City columns will be removed

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

### Step-10
#### Drop the rows

In [37]:
# again read the data
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','blr','chennai','mumbai']
data=zip(names,age,city)      # data
cols=['Names','Age','City']   # columns
idx=['A','B','C','D']     # index
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   mumbai

In [38]:
df.drop('A',axis=0,inplace=True)
df    # 'A row will be deleted from df

     Names  Age     City
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   mumbai

### Step-11
#### How to save the data frame?

- Generally data frames are two types
- csv (comma seperated value)
- excel

In [39]:
df

     Names  Age     City
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   mumbai

In [ ]:
#  you want to save in different location or same location as EDA python file in local system
# full path will be given to store in different location/folder where we want to save
# only name means same location as EDA python file

In [43]:
# file name=data
# extention=.csv
df.to_csv('data.csv')   # stored in data.csv file, extra index is coming

In [ ]:
# you can see the files data.csv,data1.csv,data2.csv under EDA python folder in our local system and in jupyter notebook as well
# these files will be opened in excel

In [44]:
df.to_csv('data1.csv',index=False)

In [ ]:
# index column will be removed and remaining rows will show up

In [45]:
# Extension
#.xlsx
df.to_excel("data2.xlsx",index=False)
# excel sheet will take up more space, check the KB how much it is taking compared to csv, so we don't use excel

In [40]:
name=['Aayush','Avinash','Akash','Avani']
age=[20,25,30,35]
city=['Ahmedabad','Pune','Hydrabad','Mumbai']
country=['India','India','India','India']
data=zip(name,age,city,country)
cols=['Names','Age','City','Country']
idx=['A','B','C','D']
df_bhavesh=pd.DataFrame(data,index=idx,columns=cols)
df_bhavesh

     Names  Age       City Country
A   Aayush   20  Ahmedabad   India
B  Avinash   25       Pune   India
C    Akash   30   Hydrabad   India
D    Avani   35     Mumbai   India

In [41]:
df_bhavesh.drop('A',axis=0,inplace=True)
df_bhavesh   # row 'A' will be deleted

     Names  Age      City Country
B  Avinash   25      Pune   India
C    Akash   30  Hydrabad   India
D    Avani   35    Mumbai   India